var parse = require('csv-parse');
const fs = require('fs');
const path = require('path');

let arrR = {"q":"й","w":"ц","e":"у","r":"к","t":"е","y":"н","u":"г","i":"ш","o":"щ","p":"з","[":"х","]":"ъ","a":"ф","s":"ы","d":"в","f":"а","g":"п","h":"р","j":"о","k":"л","l":"д",";":"ж","'":"э","z":"я","x":"ч","c":"с","v":"м","b":"и","n":"т","m":"ь",",":"б",".":"ю","/":".","`":"ё","Q":"Й","W":"Ц","E":"У","R":"К","T":"Е","Y":"Н","U":"Г","I":"Ш","O":"Щ","P":"З","{":"Х","}":"Ъ","A":"Ф","S":"Ы","D":"В","F":"А","G":"П","H":"Р","J":"О","K":"Л","L":"Д",":":"^","\"":"Э","|":"/","Z":"Я","X":"Ч","C":"С","V":"М","B":"И","N":"Т","M":"Ь","<":"Б",">":"Ю","?":",","~":"Ё","@":"\"","#":"№","$":";","^":":","&":"?","й":"q","ц":"w","у":"e","к":"r","е":"t","н":"y","г":"u","ш":"i","щ":"o","з":"p","х":"[","ъ":"]","ф":"a","ы":"s","в":"d","а":"f","п":"g","р":"h","о":"j","л":"k","д":"l","ж":";","э":"'","я":"z","ч":"x","с":"c","м":"v","и":"b","т":"n","ь":"m","б":",","ю":".","ё":"`","Й":"Q","Ц":"W","У":"E","К":"R","Е":"T","Н":"Y","Г":"U","Ш":"I","Щ":"O","З":"P","Х":"{","Ъ":"}","Ф":"A","Ы":"S","В":"D","А":"F","П":"G","Р":"H","О":"J","Л":"K","Д":"L","Ж":":","Э":"\"","Я":"Z","Ч":"X","С":"C","М":"V","И":"B","Т":"N","Ь":"M","Б":"<","Ю":">","Ё":"~","№":"#"}

let engR = {};

Object.keys(arrR).map(k => {
  engR[arrR[k]] = k;
});


fs.readFile(path.join(__dirname, 'freqrnc2011.csv'), 'utf8', function(err, contents) {
  parse(contents, function(err, output){
    let json = output.map(row => row[0].split('\t')[0]);


    let outputJson = {};

    json.map(key => {
      outputJson[key.toLowerCase().split('').map(c => engR[c]).join('')] = true;
    });

    fs.writeFile(path.join(__dirname, 'fdict.json'), JSON.stringify(outputJson), (err) => {
      if (err) throw err;
      console.log('Converted');
    })
  });
});

